app/Views/master/siswarombel.php

SELECT COUNT(*) AS `numrows`
FROM `t_siswa_rombel`
WHERE `id_rombel` = '1'
---
                                                                $db = \Config\Database::connect();
                                                                $builder = $db->table('t_siswa_rombel');
                                                                $builder->where('id_rombel', $id);
                                                                $all =  $builder->countAllResults();