app/Views/index/navbar.php

SELECT *
FROM `t_setting_aplikasi`
---
                <?php
                $db = \Config\Database::connect();
                $builder = $db->table('t_setting_aplikasi');
                $query =  $builder->get();