app/Models/Rombel_model.php

SELECT *
FROM `t_rombel`
JOIN `r_tingkat_kelas` ON `r_tingkat_kelas`.`id_tingkat_kelas` = `t_rombel`.`id_tingkat_kelas`
WHERE `id_tapel` = '1'
ORDER BY `nm_rombel` ASC
---
    public function getRombel($id)
    {
        return $this->db->table($this->table)
        ->join('r_tingkat_kelas','r_tingkat_kelas.id_tingkat_kelas = t_rombel.id_tingkat_kelas')
        ->where('id_tapel', $id)
        ->orderby('nm_rombel','ASC')
        ->get()->getResultArray();

DELETE FROM `t_rombel`
WHERE `id_rombel` = '2'
---
    public function hapusRombel($id)
    {
        $builder = $this->db->table($this->table);
        return $builder->delete(['id_rombel' => $id]);