app/Models/Siswarombel_model.php

SELECT `t_siswa_rombel`.`id_siswa` as `id_siswa`, `no_induk`, `nm_siswa`, `nm_rombel`, `jk`, `id_siswa_rombel`, `t_siswa_rombel`.`id_rombel` as `id_rombel`
FROM `t_siswa_rombel`
LEFT JOIN `t_siswa` ON `t_siswa`.`id_siswa` = `t_siswa_rombel`.`id_siswa`
LEFT JOIN `t_rombel` ON `t_rombel`.`id_rombel` = `t_siswa_rombel`.`id_rombel`
WHERE `t_siswa_rombel`.`id_rombel` IS NULL
---
    public function getSiswarombel($id)
    {
        return $this->db->table($this->table)
        ->select('t_siswa_rombel.id_siswa as id_siswa, no_induk, nm_siswa, nm_rombel, jk, id_siswa_rombel, t_siswa_rombel.id_rombel as id_rombel')
        ->join('t_siswa','t_siswa.id_siswa = t_siswa_rombel.id_siswa', 'LEFT')
        ->join('t_rombel','t_rombel.id_rombel = t_siswa_rombel.id_rombel', 'LEFT')
        ->where('t_siswa_rombel.id_rombel', $id)
        ->get()->getResultArray();