app/Models/Siswa_model.php

    public function getSiswafilterkelas($id_tapel)
    {
        return $this->db->table($this->table)
        ->select('t_siswa.id_siswa as id_siswa,no_induk,nm_siswa')
        ->join('t_siswa_rombel', 't_siswa_rombel.id_siswa = t_siswa.id_siswa')
        ->where('sts_siswa', 1)
        ->where('id_tapel', $id_tapel)
        ->get()->getResultArray();
---
SELECT `t_siswa`.`id_siswa` as `id_siswa`, `no_induk`, `nm_siswa`
FROM `t_siswa`
JOIN `t_siswa_rombel` ON `t_siswa_rombel`.`id_siswa` = `t_siswa`.`id_siswa`
WHERE `sts_siswa` = 1
AND `id_tapel` = '1'