app/Models/Totalpointsiswa_model.php

SELECT `no_induk`, `nm_siswa`, `jml_point`, `nm_rombel`
FROM `t_total_point_siswa`
JOIN `t_siswa` ON `t_siswa`.`id_siswa` = `t_total_point_siswa`.`id_siswa`
JOIN `t_siswa_rombel` ON `t_siswa_rombel`.`id_siswa` = `t_siswa`.`id_siswa`
JOIN `t_rombel` ON `t_rombel`.`id_rombel` = `t_siswa_rombel`.`id_rombel`
WHERE `bln` = '01'
AND `t_total_point_siswa`.`id_tapel` = '1'
ORDER BY `jml_point` DESC
 LIMIT 50
---
    public function getTotalpointsiswa($bln,  $id_tapel)
    {
        return $this->db->table($this->table)
        ->select('no_induk, nm_siswa, jml_point, nm_rombel')
        ->join('t_siswa', 't_siswa.id_siswa = t_total_point_siswa.id_siswa')
        ->join('t_siswa_rombel', 't_siswa_rombel.id_siswa = t_siswa.id_siswa')
        ->join('t_rombel', 't_rombel.id_rombel = t_siswa_rombel.id_rombel')
        ->where('bln', $bln)
        ->where('t_total_point_siswa.id_tapel',  $id_tapel)
        ->orderBy('jml_point', 'desc')
        ->limit(50)
        ->get()->getResultArray();