app/Views/func_siswa.php

  function sts_absen($id_siswa,$tgl) {
    $tglpil = strtotime($tgl);
    $tglnow = strtotime(date('Y-m-d'));
    //cek hari libur
    $namahari = date('l', strtotime($tgl));
    if($namahari=="Sunday"){
        $hari= "Minggu";
    }elseif($namahari=="Monday"){
        $hari= "Senin";
    }elseif($namahari=="Tuesday"){
        $hari= "Selasa";
    }elseif($namahari=="Wednesday"){
        $hari= "Rabu";
    }elseif($namahari=="Thursday"){
        $hari= "Kamis";
    }elseif($namahari=="Friday"){
        $hari= "Jumat";
    }elseif($namahari=="Saturday"){
        $hari= "Sabtu";
    }

    if($tglpil>$tglnow){
        $sts="-";
    }else{

        //cek apakah ada jadwal libur hari besar
        $db = \Config\Database::connect();
        $builder_lbrbesar = $db->table('libur_besar');
        $builder_lbrbesar->where('tgl_libur', $tgl);
        $liburbesar =  $builder_lbrbesar->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `libur_besar`
WHERE `tgl_libur` = '2026-1-1'


            //cek apakah ada jadwal jam masuk pulang di entri
            $builder_jadwal = $db->table('r_hari');
            $jadwal =  $builder_jadwal->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `r_hari`

function jummasukblnadmin($bln) {
    //cek apakah ada absen masuk
    $db = \Config\Database::connect();
    $thn = date('Y');
	$builder = $db->table('t_siswa_hadir');
    $builder->where('sts_hadir', 0);
    $builder->where('MONTH(tgl_hadir)', $bln);
    $builder->where('YEAR(tgl_hadir)', $thn);
    $all =  $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `t_siswa_hadir`
WHERE `sts_hadir` = 0
AND MONTH(tgl_hadir) = 1
AND YEAR(tgl_hadir) = '2026'

function jumterlambatblnadmin($bln) {
    $db = \Config\Database::connect();
    $thn = date('Y');
	$builder = $db->table('t_siswa_hadir');
    $builder->where('sts_hadir', 0);
    $builder->where('MONTH(tgl_hadir)', $bln);
    $builder->where('YEAR(tgl_hadir)', $thn);
    $all =  $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `t_siswa_hadir`
WHERE `sts_hadir` = 0
AND MONTH(tgl_hadir) = 1
AND YEAR(tgl_hadir) = '2026'

function nmrombel($id_rombel) {
    $db = \Config\Database::connect();
    $builder = $db->table('t_rombel');
    $builder->where('id_rombel', $id_rombel);

    $all =  $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `t_rombel`
WHERE `id_rombel` IS NULL

function idsiswatoidrombel($id,$idtapel) {
    $db = \Config\Database::connect();
    $builder = $db->table('t_siswa_rombel');
    $builder->where('id_siswa', $id);
    $builder->where('id_tapel', $idtapel);

    $all =  $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `t_siswa_rombel`
WHERE `id_siswa` = '1'
AND `id_tapel` = '1'